In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Company' : ['Amazon','Amazon','Facebook','Facebook','Google','Google'],
    'Person' : ['Sam','Charlie','Mahesh','Prachi','Carl','Sarah'],
    'Sales' : [200,120,180,165,195,210]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    Company   Person  Sales
0    Amazon      Sam    200
1    Amazon  Charlie    120
2  Facebook   Mahesh    180
3  Facebook   Prachi    165
4    Google     Carl    195
5    Google    Sarah    210

In [6]:
bycomp = df.groupby('Company')

In [8]:
bycomp.mean()

          Sales
Company
Amazon    160.0
Facebook  172.5
Google    202.5

In [9]:
bycomp.sum()

          Sales
Company
Amazon      320
Facebook    345
Google      405

In [10]:
bycomp.std()

              Sales
Company
Amazon    56.568542
Facebook  10.606602
Google    10.606602

In [12]:
bycomp.mean().loc['Google']

Sales    202.5
Name: Google, dtype: float64

In [13]:
bycomp.count()

          Person  Sales
Company
Amazon         2      2
Facebook       2      2
Google         2      2

In [14]:
bycomp.min()

           Person  Sales
Company
Amazon    Charlie    120
Facebook   Mahesh    165
Google       Carl    195

In [15]:
df.groupby('Company').describe()

         Sales
         count   mean        std    min     25%    50%     75%    max
Company
Amazon     2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
Facebook   2.0  172.5  10.606602  165.0  168.75  172.5  176.25  180.0
Google     2.0  202.5  10.606602  195.0  198.75  202.5  206.25  210.0

In [16]:
df.groupby('Company').describe().loc['Amazon']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Amazon, dtype: float64